'''
字典 dict
    key:必须是不可变的类型,如int,str，元组()    value：str int float list set dict
    {key1:value1, key2:value2...}
'''

print(type({1:1,2:2,3:3}));
print('获得技能：');
print({'Q':'新月打击','W':'苍白之瀑','E':'月之降临','R':'月神冲刺'}['Q']);
print('字典没有相同的键：');
print({'Q':'新月打击','Q':'苍白之瀑','E':'月之降临','R':'月神冲刺'}['Q']);
print({'Q':'新月打击','Q':'苍白之瀑','E':'月之降临','R':'月神冲刺'});

#   再看一个有趣的例子,数字1和字符串1会被识别为两个1
print({1:'新月打击','1':'苍白之瀑','E':'月之降临','R':'月神冲刺'});

#   value中可以包含字典
print(type({1:'新月打击','1':'苍白之瀑','E':{1:1},'R':'月神冲刺'}));

#   key:必须是不可变的类型,如int,str
print(type({(1,2):'新月打击','1':'苍白之瀑','E':{1:1},'R':'月神冲刺'}));
print({(1,2):'新月打击','1':'苍白之瀑','E':{1:1},'R':'月神冲刺'}[(1,2)]);

#   空的字典 {}








