'''







                    |数字(Number) ----整形int   浮点型float    布尔型bool     复数complex
                    |
python基本数据类型---
                    |
                    |组          -----|序列    ------|字符串str 不可变    }
                                                    |列表list           }有序，可用下标索引来访问，切片操作[0:5]
                                                    |元组tuple 不可变    }



                                      |集合   无序，没有索引，不能切片

                                      |字典   key:value 键值对是最基本的概念























'''